# Different types of missing data

1. Missing Completely at Random , MCAR:
There is absolutely no relationship between the missing values and any other observations.

In [1]:
import pandas as pd

In [3]:
df=pd.read_csv('/Users/kanchiharinathbadrinath/Downloads/titanic.csv')

In [4]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [5]:
df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [8]:
df[df['Embarked'].isnull()]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
61,62,1,1,"Icard, Miss. Amelie",female,38.0,0,0,113572,80.0,B28,NaN
829,830,1,1,"Stone, Mrs. George Nelson (Martha Evelyn)",female,62.0,0,0,113572,80.0,B28,NaN

In [12]:
##The above shown Embarked category has 2 null values or the missing values
#BUt we there is no relationship between the Embarked and other observations. 
#So, This is the example of Missing completely at random.

# Now we can see the missing data NOT AT RANDOM :Systematic missing values

## there is absolutely some relationship between the data missing and 
##other values ,observed or missing within the dataset

In [14]:
import numpy as np

In [18]:
df['Cabin_null']=np.where(df['Cabin'].isnull().sum(),1,0)

In [19]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked', 'Cabin_null'],
      dtype='object')

In [20]:
## Heree ewe can see that  Cabin_null has been created.

In [28]:
df['Cabin_null'].head(20)

0     1
1     1
2     1
3     1
4     1
5     1
6     1
7     1
8     1
9     1
10    1
11    1
12    1
13    1
14    1
15    1
16    1
17    1
18    1
19    1
Name: Cabin_null, dtype: int64

In [25]:
df['Cabin_null'].mean()

1.0

In [27]:
df.groupby(['Survived'])['Cabin_null'].mean()

Survived
0    1.0
1    1.0
Name: Cabin_null, dtype: float64

## Missing data at random

Men - Hide their salary 
Womwen - Hide their Age
1.Mean and median 
2.Random sample imputation
3.Capturing NAN values with a new feature
4.End of Distribution imputation
5.Arbitrary imputation
6.Frequent categories imputation

##mean and median menas  that has the asumption that the data are missing completely at random.
##we solve this by replacing the NAN with the most frequent occurance of the variables

In [33]:
df= pd.read_csv('titanic.csv',usecols=['Age','Fare','Survived'])
df.head()

   Survived   Age     Fare
0         0  22.0   7.2500
1         1  38.0  71.2833
2         1  26.0   7.9250
3         1  35.0  53.1000
4         0  35.0   8.0500

In [35]:
df.isna().sum()

Survived      0
Age         177
Fare          0
dtype: int64

In [36]:
df.isna().mean()

Survived    0.000000
Age         0.198653
Fare        0.000000
dtype: float64

In [38]:
def replace_nan(df,variable,median):
    df[variable+"_median"]= df[variable].fillna(median)

In [40]:
median = df.Age.median()

In [41]:
median

28.0

In [43]:
replace_nan(df,'Age',median)
df.head()

   Survived   Age     Fare  Age_median
0         0  22.0   7.2500        22.0
1         1  38.0  71.2833        38.0
2         1  26.0   7.9250        26.0
3         1  35.0  53.1000        35.0
4         0  35.0   8.0500        35.0

In [44]:
print(df.Age.std())
print(df.Age_median.std())

14.526497332334044
13.019696550973194

In [ ]:
##